import React, {Component} from 'react';
import './style.css';

class TextMessage extends Component {

	render (){
		return (
				<div id="text">
					<div>
						<p>
							AlgoJudge ესაა online სივრცე პროგრამული ალგორითმების შესასწავლად. თქვენ შეგიძლიათ ნახოთ თეორიული მასალა სხვადასხვა თემაზე. აქვეა შესაძლებელი საინტერესო ამოცანების ამოხსნა.
						</p>

						<p>
							თუ თქვენ რეგისტრაციას გაივლით და შემდეგ შეხვალთ სისტემაში, შეძლებთ გადმოწეროთ თქვენთვის საინტერესო თემა ან გაუშვათ ამოცანის ამოხსნა ტესტებზე.
						</p>
				    </div>
				    <div>
				    	<h3>გამოყენების წესები</h3>
				      <p>
				      	ამოცანის ამოხსნის დაწერა შეგიძლიათ საიტზე განთავსებულ მოსახერხებელ editor_ში. კატეგორიაში "თეორია და პრაქტიკა / ამოცანები" კონკრეტული თემისა და შემდეგ კონკრეტული ამოცანის არჩევით გამოჩნდება ამოცანასთან დაკავშირებული განყოფილებები: ამოცანის პირობა, ტესტები, ამოხსნის დასაწერი editor, ანალიზი და მითითებები.
				      </p>

				      <p>
				      	თქვენ შეძლებთ ნახოთ ტესტების input / output ნაწილები და ამავდროულად შეძლებთ თვალი გადაავლოთ თქვენს დაწერილ კოდს editor-ში. ტესტების განყოფილებაში შესაძლებელია კონკრეტული ტესტების მონიშვნა და კოდი მხოლოდ მათზე გაეშვება.
				      </p>

				      <p>
				      	ანალიზის განყოფილებაში შეძლებთ სხვა მომხმარებლებთან ერთად გაარჩიოთ თქვენი ამოხსნა ან განიხილოთ ამოცანის პირობა და დეტალები.
				      </p>
				      <p>
				      	რაც შეეხება კოდის გაშვებას, აუცილებელია ჯერ კოდმა გაიაროს კომპილაციის ეტაპი და მხოლოდ ამის შემდეგ გაეშვას ტესტებზე, რომლებიც ტესტების განყოფილებაშია მონიშნული. პროგრამული ენის არჩევის შემდეგ editor-ი თავად დააგენერირებს ბაზისურ კოდს ამოხსნის დაწყებისთვის.
				      </p>
				    </div>
		    </div>
		);
	}
}


export default TextMessage;